In [1]:
import pandas as pd

In [2]:
data = {
    'ID': [101, 102, 103, '104', 105],
    'Name': ['Sanjog', 'Anil', 'Rita', 'Kiran', 123],
    'Age': [25, 'Thirty', 22, 28, 30],
    'Salary': [30000, 25000, 'Thirty-five thousand', 32000, 40000],
    'Department': ['IT', 'HR', 'Finance', 'IT', 100]
}
data

{'ID': [101, 102, 103, '104', 105],
 'Name': ['Sanjog', 'Anil', 'Rita', 'Kiran', 123],
 'Age': [25, 'Thirty', 22, 28, 30],
 'Salary': [30000, 25000, 'Thirty-five thousand', 32000, 40000],
 'Department': ['IT', 'HR', 'Finance', 'IT', 100]}

In [3]:
df=pd.DataFrame(data)
df

    ID    Name     Age                Salary Department
0  101  Sanjog      25                 30000         IT
1  102    Anil  Thirty                 25000         HR
2  103    Rita      22  Thirty-five thousand    Finance
3  104   Kiran      28                 32000         IT
4  105     123      30                 40000        100